1yib.rust-bundle
aaron-bond.better-comments
alexcvzz.vscode-sqlite
brunnerh.insert-unicode
catppuccin.catppuccin-vsc-icons
christian-kohler.path-intellisense
coq-community.vscoq1
dafny-lang.ide-vscode
divyanshuagrawal.competitive-programming-helper
dongli.python-preview
dotjoshjohnson.xml
dracula-theme.theme-dracula
ecmel.vscode-html-css
esbenp.prettier-vscode
foxundermoon.shell-format
genuitecllc.codetogether
grapecity.gc-excelviewer
haskell.haskell
hediet.vscode-drawio
hyperclaw79.vssticky
iamhyc.overleaf-workshop
idleberg.icon-fonts
j4ng5y.charactercount
james-yu.latex-workshop
jebbs.plantuml
jeffersonqin.latex-snippets-jeff
juanblanco.solidity
justusadam.language-haskell
kelvin.vscode-sshfs
kisstkondoros.vscode-gutter-preview
l13rary.l13-projects
lalithk90.springboot-mvc-with-thymeleaf
learnwithyan.dedupli
llvm-vs-code-extensions.vscode-clangd
mathematic.vscode-latex
mermaidchart.vscode-mermaid-chart
mgesbert.python-path
mhutchie.git-graph
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
ms-vscode.makefile-tools
ms-vscode.vscode-serial-monitor
ms-vscode.vscode-speech
njqdev.vscode-python-typehint
perkovec.emoji
platformio.platformio-ide
qwtel.sqlite-viewer
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
reditorsupport.r
ruoz.coq
rust-lang.rust-analyzer
tamasfe.even-better-toml
tecosaur.latex-utilities
thang-nm.catppuccin-perfect-icons
tianyishi.rmarkdown
tomoki1207.pdf
trybick.terminal-zoom
twxs.cmake
vincaslt.highlight-matching-tag
waderyan.gitblame
wakatime.vscode-wakatime
yandeu.five-server
yutengjing.open-in-external-app
yzane.markdown-pdf
yzhang.markdown-all-in-one
zainchen.json